## Final Project: Avocado Prices

In [9]:
import pandas as pd
import numpy as np

In [13]:
file = "data/avocado.csv"
raw_df = pd.read_csv(file)
raw_df.head(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [21]:
drop_cols_df = raw_df[['Date', 'AveragePrice', 'Total Volume', '4046', '4225',
                       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags',
                       'type','year', 'region']]

In [22]:
column_rename_df = drop_cols_df.rename(columns={
    'AveragePrice':'Average Price',
    '4046':'PLU 4046',
    '4225':'PLU 4225',
    '4770':'PLU 4770',
    'XLarge Bags':'XL Bags',
    'type':'Type',
    'year':'Year',
    'region':'Region'    
})

In [23]:
column_rename_df.head(2)

,Date,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

In [24]:
column_rename_df.count()

Date             18249
Average Price    18249
Total Volume     18249
PLU 4046         18249
PLU 4225         18249
PLU 4770         18249
Total Bags       18249
Small Bags       18249
Large Bags       18249
XL Bags          18249
Type             18249
Year             18249
Region           18249
dtype: int64

In [27]:
drop_na_df = column_rename_df.dropna(how='any')
drop_na_df.count()

Date             18249
Average Price    18249
Total Volume     18249
PLU 4046         18249
PLU 4225         18249
PLU 4770         18249
Total Bags       18249
Small Bags       18249
Large Bags       18249
XL Bags          18249
Type             18249
Year             18249
Region           18249
dtype: int64

In [28]:
drop_na_df.dtypes

Date              object
Average Price    float64
Total Volume     float64
PLU 4046         float64
PLU 4225         float64
PLU 4770         float64
Total Bags       float64
Small Bags       float64
Large Bags       float64
XL Bags          float64
Type              object
Year               int64
Region            object
dtype: object

In [34]:
drop_na_df.describe()

,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Year
count,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000